In [4]:
import pandas as pd
import numpy as np 
from scipy.stats import chisquare
from src.utils.data_handler import DataHandler

In [13]:
df = pd.DataFrame({'A': ['adbert', 'elbert', 'albert', 'albert', 'albert']})
df2 = pd.DataFrame({'A': ['edbert', 'elbert', 'albert', 'albert', 'albert'],
                    'B': ['edbert', 'elbert', 'albert', 'albert', 'albert']})

In [6]:
df.groupby('A').size().values

array([1, 3, 1])

In [7]:
def perform_chi_square(column_name: str, f_obs: np.array, 
                       f_exp: np.array) -> tuple[str, float]:

    return column_name, chisquare(f_obs=f_obs, f_exp=f_exp)[1]

In [8]:
f_obs = df.groupby('A').size().values
f_exp = df.groupby('A').size().values
perform_chi_square('A', f_obs, f_exp)

('A', 1.0)

In [9]:
list(df.columns)

['A']

In [14]:
dh = DataHandler(target=df2, source=df)
dh.source

        A
0  adbert
1  elbert
2  albert
3  albert
4  albert

In [15]:
dh.check_columns()
dh.type_df

  column_names column_types
0            A  categorical

In [16]:
dh.target

        A       B
0  edbert  edbert
1  elbert  elbert
2  albert  albert
3  albert  albert
4  albert  albert

In [17]:
dh.coerce_quality()
dh.target

        A
0  edbert
1  elbert
2  albert
3  albert
4  albert

In [19]:
from scipy import stats

In [22]:
rng = np.random.default_rng()
x = stats.norm.rvs(size=100, random_state=rng)
y = stats.norm.rvs(size=50, random_state=rng)

In [24]:
stats.kstest(x, y)[1]

0.17315204564912917